In [1]:
import numpy as np
import pandas as pd

In [5]:
d = {'A':[1,2,np.nan],
     'B':[5,np.nan,np.nan],
     'C':[4,2,5]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  4
1  2.0  NaN  2
2  NaN  NaN  5

In [14]:
# drop rows with missing values
# to drop columns indicate axis=1
# df.dropna()
df.dropna(axis = 1)

   C
0  4
1  2
2  5

In [15]:
# set threshold for missing values

df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  4
1  2.0  NaN  2

In [17]:
# fill missing values
df.fillna(value='FILL')

      A     B  C
0     1     5  4
1     2  FILL  2
2  FILL  FILL  5

In [18]:
# fill with a mean value
df.fillna(value=df.mean())

     A    B  C
0  1.0  5.0  4
1  2.0  5.0  2
2  1.5  5.0  5

### GroupBy

In [22]:
# groupby allows you to group together rows based of a column
# and perform an aggregate function

# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [23]:
# groupby company
byComp = df.groupby('Company')
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [25]:
byComp.sum().loc['GOOG']

Sales    320
Name: GOOG, dtype: int64

In [26]:
byComp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [29]:
byComp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0